app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---

        $this->data['session']=$session;
        $this->data['page_title']="Users";
        $this->data['user'] = $this->auth_model->where("id ='{$session->login_id}'")->first();